In [4]:
import pandas as pd

In [5]:
people = {
    'first' : ['Shah', 'Shah', 'Kawser'],
    'last' : ['Newaz', 'Waliullah', 'Rana'],
    'email' : ['demo1@mail.com', 'demo2@mail.com', 'demo3@mail.com'],
    'age' : [23, 34, 45]
}

In [6]:
df = pd.DataFrame(people)

In [7]:
df

    first       last           email  age
0    Shah      Newaz  demo1@mail.com   23
1    Shah  Waliullah  demo2@mail.com   34
2  Kawser       Rana  demo3@mail.com   45

In [8]:
df.columns

Index(['first', 'last', 'email', 'age'], dtype='object')

In [9]:
df.columns = ['First_Name', 'Last_Name', 'Email', 'age']

In [10]:
df

  First_Name  Last_Name           Email  age
0       Shah      Newaz  demo1@mail.com   23
1       Shah  Waliullah  demo2@mail.com   34
2     Kawser       Rana  demo3@mail.com   45

In [11]:
df.columns = [x.upper() for x in df.columns]

In [12]:
df

  FIRST_NAME  LAST_NAME           EMAIL  AGE
0       Shah      Newaz  demo1@mail.com   23
1       Shah  Waliullah  demo2@mail.com   34
2     Kawser       Rana  demo3@mail.com   45

In [13]:
df.columns = df.columns.str.replace('_', ' ')
df

  FIRST NAME  LAST NAME           EMAIL  AGE
0       Shah      Newaz  demo1@mail.com   23
1       Shah  Waliullah  demo2@mail.com   34
2     Kawser       Rana  demo3@mail.com   45

In [14]:
df.columns = df.columns.str.replace(' ', '_')
df

  FIRST_NAME  LAST_NAME           EMAIL  AGE
0       Shah      Newaz  demo1@mail.com   23
1       Shah  Waliullah  demo2@mail.com   34
2     Kawser       Rana  demo3@mail.com   45

In [15]:
df.rename(columns={'FIRST_NAME' : 'first_name'}, inplace=True)

In [16]:
df

  first_name  LAST_NAME           EMAIL  AGE
0       Shah      Newaz  demo1@mail.com   23
1       Shah  Waliullah  demo2@mail.com   34
2     Kawser       Rana  demo3@mail.com   45

In [17]:
df.loc[2]

first_name            Kawser
LAST_NAME               Rana
EMAIL         demo3@mail.com
AGE                       45
Name: 2, dtype: object

In [18]:
df.loc[2] = ['Hamid', 'Kawser', 'rana@mail.com', 30]

In [19]:
df

  first_name  LAST_NAME           EMAIL  AGE
0       Shah      Newaz  demo1@mail.com   23
1       Shah  Waliullah  demo2@mail.com   34
2      Hamid     Kawser   rana@mail.com   30

In [20]:
df.loc[2, ['first_name', 'EMAIL']]

first_name            Hamid
EMAIL         rana@mail.com
Name: 2, dtype: object

In [21]:
df.loc[2, ['first_name', 'EMAIL']] = ['Kawser', 'rananew@mail.com']

In [22]:
df

  first_name  LAST_NAME             EMAIL  AGE
0       Shah      Newaz    demo1@mail.com   23
1       Shah  Waliullah    demo2@mail.com   34
2     Kawser     Kawser  rananew@mail.com   30

In [23]:
df.loc[2, 'first_name'] = 'Rana'

In [24]:
df

  first_name  LAST_NAME             EMAIL  AGE
0       Shah      Newaz    demo1@mail.com   23
1       Shah  Waliullah    demo2@mail.com   34
2       Rana     Kawser  rananew@mail.com   30

In [25]:
fltr = (df['EMAIL'] == 'demo1@mail.com')
df[fltr]['LAST_NAME']

0    Newaz
Name: LAST_NAME, dtype: object

In [26]:
fltr = (df['EMAIL'] == 'demo1@mail.com')
df.loc[fltr, 'LAST_NAME'] = 'Shawon'

In [27]:
df

  first_name  LAST_NAME             EMAIL  AGE
0       Shah     Shawon    demo1@mail.com   23
1       Shah  Waliullah    demo2@mail.com   34
2       Rana     Kawser  rananew@mail.com   30

In [28]:
df['EMAIL'].apply(len)

0    14
1    14
2    16
Name: EMAIL, dtype: int64

In [29]:
def update_email(email):
    return email.upper()

In [30]:
df['EMAIL'].apply(update_email)

0      DEMO1@MAIL.COM
1      DEMO2@MAIL.COM
2    RANANEW@MAIL.COM
Name: EMAIL, dtype: object

In [31]:
df

  first_name  LAST_NAME             EMAIL  AGE
0       Shah     Shawon    demo1@mail.com   23
1       Shah  Waliullah    demo2@mail.com   34
2       Rana     Kawser  rananew@mail.com   30

In [32]:
df['EMAIL'] = df['EMAIL'].apply(update_email)

In [33]:
df

  first_name  LAST_NAME             EMAIL  AGE
0       Shah     Shawon    DEMO1@MAIL.COM   23
1       Shah  Waliullah    DEMO2@MAIL.COM   34
2       Rana     Kawser  RANANEW@MAIL.COM   30

In [34]:
df['EMAIL'] = df['EMAIL'].apply(lambda x: x.lower())

In [35]:
df['EMAIL'].apply(len)

0    14
1    14
2    16
Name: EMAIL, dtype: int64

In [36]:
df.apply(len)

first_name    3
LAST_NAME     3
EMAIL         3
AGE           3
dtype: int64

In [37]:
df.apply(len, axis='rows')

first_name    3
LAST_NAME     3
EMAIL         3
AGE           3
dtype: int64

In [38]:
df.apply(len, axis='columns')

0    4
1    4
2    4
dtype: int64

In [39]:
df.apply(pd.Series.min)

first_name              Rana
LAST_NAME             Kawser
EMAIL         demo1@mail.com
AGE                       23
dtype: object

In [40]:
df.apply(lambda x: x.min())

first_name              Rana
LAST_NAME             Kawser
EMAIL         demo1@mail.com
AGE                       23
dtype: object

In [41]:
df.map(lambda x : len(str(x)))

   first_name  LAST_NAME  EMAIL  AGE
0           4          6     14    2
1           4          9     14    2
2           4          6     16    2

In [42]:
df

  first_name  LAST_NAME             EMAIL  AGE
0       Shah     Shawon    demo1@mail.com   23
1       Shah  Waliullah    demo2@mail.com   34
2       Rana     Kawser  rananew@mail.com   30

In [43]:
df['LAST_NAME'].map({'Newaz':'Shawon', 'Kawser':'Hamid'})

0      NaN
1      NaN
2    Hamid
Name: LAST_NAME, dtype: object

In [44]:
df['LAST_NAME'].replace({'Newaz':'Shawon', 'Kawser':'Hamid'})

0       Shawon
1    Waliullah
2        Hamid
Name: LAST_NAME, dtype: object

In [55]:
df['first_name'] + ' ' + df['LAST_NAME']

0       Shah Shawon
1    Shah Waliullah
2       Rana Kawser
dtype: object

In [58]:
df['Full_Name'] = df['first_name'] + ' ' + df['LAST_NAME']

In [60]:
df

  first_name  LAST_NAME             EMAIL  AGE       Full Name       Full_Name
0       Shah     Shawon    demo1@mail.com   23     Shah Shawon     Shah Shawon
1       Shah  Waliullah    demo2@mail.com   34  Shah Waliullah  Shah Waliullah
2       Rana     Kawser  rananew@mail.com   30     Rana Kawser     Rana Kawser

In [62]:
df.drop(columns=['Full Name'])

  first_name  LAST_NAME             EMAIL  AGE       Full_Name
0       Shah     Shawon    demo1@mail.com   23     Shah Shawon
1       Shah  Waliullah    demo2@mail.com   34  Shah Waliullah
2       Rana     Kawser  rananew@mail.com   30     Rana Kawser

In [63]:
df

  first_name  LAST_NAME             EMAIL  AGE       Full Name       Full_Name
0       Shah     Shawon    demo1@mail.com   23     Shah Shawon     Shah Shawon
1       Shah  Waliullah    demo2@mail.com   34  Shah Waliullah  Shah Waliullah
2       Rana     Kawser  rananew@mail.com   30     Rana Kawser     Rana Kawser

In [64]:
df.drop(columns=['Full Name'], inplace=True)

In [65]:
df

  first_name  LAST_NAME             EMAIL  AGE       Full_Name
0       Shah     Shawon    demo1@mail.com   23     Shah Shawon
1       Shah  Waliullah    demo2@mail.com   34  Shah Waliullah
2       Rana     Kawser  rananew@mail.com   30     Rana Kawser

In [66]:
df['Full_Name'].str.split(' ')

0       [Shah, Shawon]
1    [Shah, Waliullah]
2       [Rana, Kawser]
Name: Full_Name, dtype: object